{
  "nodes": [
    {
      "op": "null", 
      "name": "label", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected0_weight", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected0_bias", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected0", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected1_weight", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected1_bias", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected1", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "enc_mu_weight", 
      "attrs": {"num_hidden": "2"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "enc_mu_bias", 
      "attrs": {"num_hidden": "2"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "enc_mu", 
      "attrs": {"num_hidden": "2"}, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "enc_lv_weight", 
      "attrs": {"num_hidden": "2"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "enc_lv_bias", 
      "attrs": {"num_hidden": "2"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "enc_lv", 
      "attrs": {"num_hidden": "2"}, 
      "inputs": [[9, 0, 0], [13, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar0", 
      "attrs": {"scalar": "0.5"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "exp", 
      "name": "exp0", 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "_random_normal", 
      "name": "random_normal0", 
      "attrs": {
        "loc": "0", 
        "scale": "1", 
        "shape": "(100, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul0", 
      "inputs": [[17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[12, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "gfc0_weight", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gfc0_bias", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "gfc0", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[20, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gfc0a", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "gfc_add0_weight", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gfc_add0_bias", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "gfc_add0", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[24, 0, 0], [25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gfc_add0a", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "y_weight", 
      "attrs": {"num_hidden": "784"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "y_bias", 
      "attrs": {"num_hidden": "784"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "y", 
      "attrs": {"num_hidden": "784"}, 
      "inputs": [[28, 0, 0], [29, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "output", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar1", 
      "attrs": {"scalar": "1e-08"}, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "log", 
      "name": "log0", 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul1", 
      "inputs": [[0, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar0", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar1", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar2", 
      "attrs": {"scalar": "1e-08"}, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "log", 
      "name": "log1", 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul2", 
      "inputs": [[36, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[35, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "logloss", 
      "attrs": {"axis": "1"}, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar2", 
      "attrs": {"scalar": "-1.0"}, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar0", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "_power_scalar", 
      "name": "_powerscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "elemwise_sub", 
      "name": "_minus0", 
      "inputs": [[44, 0, 0], [45, 0, 0]]
    }, 
    {
      "op": "exp", 
      "name": "exp1", 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "elemwise_sub", 
      "name": "_minus1", 
      "inputs": [[46, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "KL", 
      "attrs": {"axis": "1"}, 
      "inputs": [[48, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar1", 
      "attrs": {"scalar": "0.5"}, 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "elemwise_sub", 
      "name": "_minus2", 
      "inputs": [[43, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar3", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[51, 0, 0]]
    }, 
    {
      "op": "MakeLoss", 
      "name": "loss", 
      "inputs": [[52, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    3, 
    6, 
    7, 
    10, 
    11, 
    13, 
    14, 
    21, 
    22, 
    25, 
    26, 
    29, 
    30
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54
  ], 
  "heads": [[53, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10000]}
}